content.org
#+STYLE: <link rel="stylesheet" type="text/css" href="css/bootstrap/css/bootstrap.min.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="css/custom.css" />
#+TITLE: Clojure Training

* Intro to Functional Programming with Clojure

** What is functional programming
   Functions are first class objects
    - It can be created on demand.
    - It can be stored in a data structure.
    - It can be passed as an argument to a function.
    - It can be returned as the value of a function.

*** Why do we need functional programming?

    
    In computer science, functional programming is a programming paradigm style of building the structure and elements of computer programs that treats computation as the evaluation of
    mathematical functions and avoids changing-state and mutable data.

    Functional programming makes it easy to implement distributed/parallel computing.
    
    Moore's law for computing hardware is fluctuating. Processors are not getting faster anymore.
    More efficient computing is achieved by adding more cores.


** Higher order functions
   Functions that can take functions or values as an input and return a new function or functions as output.
   
** Anonymous Functions
   Anonymous functtions are functions without an identity or a name.
   These type of functions are commonly used as callbacks for an event where no other reference is needed.
   Another use case for anonymous functions is using it as a filter for a data set or applying a functional transformation for a set of data
   
** Functional composition
   "Function Composition" is applying one function to the results of another.
   You can have a pipe line of functions through which data is passed through. And this pipe line can be termed as a new function.
   You can create a new function from a set of functions.

** Pure functions and immutablilty

   Pure function is a function which has no side effects. It does not depend on any external entities.
   For every input, there is only one out put
   Example: Area of a circle = pi*r*r
   
   Examples of impure functions: current time, or time related functions. Database operations. File operations or reading data from an external API
   
   
** Map Reduce Filter

   Map reduce is a programming model. A map reduce approach helps in distributed computing.

*** Map
    Common syntax:
    
    map->function->data set

    Outputs a set of data
    
    Function in a map accepts a value or another function.

    Example case: Increment every value in an array by one

    syntax: map increment-function array
   
*** Reduce
    Common syntax:

    reduce->function <optional initial value> -> data set
    
    Reduce function accepts two values, previous value and next value
    Returns a single output entity which is a reduced form of dataset
    
    

* Intoduction to Clojure

** What is Clojure
   Clojure is a general purpose, compiled, dynamic, functional programming language.
   Clojure is a member of the Lisp family of languages.
   Lisp was a revolutionary programming language which first appeared in 1958 and was too advanced at that time.
   Lisp was originally created as a practical mathematical notation for computer programs, influenced by lambda calculus
   
** Advantages of Clojure
   - Clojure is simple. *Simple is elegant, simple is beautiful.*
   - Clojure uses lesser lines of code. Anywhere between 10-20x lesser lines of code than Java.
   - Clojure is a Lisp. *Code is Data*
   - Clojure is functional *Functional programming will be a necessary programming model in the near future*
   - Clojure supports true concurrent models
   - Clojure REPL helps in interactive development
   - Clojure runs on JVM
     It can take advantage of highly optimized JVM and its garbage collector. It can utilize Java libraries
   - Clojure can be used as a replacement for javascript in the front end
   
   
   
** Disadvantages of Clojure
   - Major shift in programming model.
   - Lisp syntax is different and some people never gets it.
   - Relatively new technology. Released in 2007 and fewer libraries and developers
   
