content.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Clojure Training</title>
<!-- 2016-04-28 Thu 06:55 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Devasia Joseph" />
</head>
<body>
<div id="content">
<h1 class="title">Clojure Training</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Intro to Functional Programming with Clojure</a>
<ul>
<li><a href="#sec-1-1">1.1. What is functional programming</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Why do we need functional programming?</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Higher order functions</a></li>
<li><a href="#sec-1-3">1.3. Anonymous Functions</a></li>
<li><a href="#sec-1-4">1.4. Functional composition</a></li>
<li><a href="#sec-1-5">1.5. Pure functions and immutablilty</a></li>
<li><a href="#sec-1-6">1.6. Map Reduce Filter</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. Map</a></li>
<li><a href="#sec-1-6-2">1.6.2. Reduce</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Intoduction to Clojure</a>
<ul>
<li><a href="#sec-2-1">2.1. What is Clojure</a></li>
<li><a href="#sec-2-2">2.2. Advantages of Clojure</a></li>
<li><a href="#sec-2-3">2.3. Disadvantages of Clojure</a></li>
<li><a href="#sec-2-4">2.4. Installing Clojure</a></li>
<li><a href="#sec-2-5">2.5. Tooling</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. IDE</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. Basic Clojure Syntax and REPL</a>
<ul>
<li><a href="#sec-3-1">3.1. Lisp syntax</a></li>
<li><a href="#sec-3-2">3.2. The REPL</a></li>
<li><a href="#sec-3-3">3.3. Code execution and Project Structure</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1. Source code</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Clojure Namespaces</a>
<ul>
<li><a href="#sec-4-1">4.1. What is a namespace?</a></li>
<li><a href="#sec-4-2">4.2. The 'user' namespace</a></li>
<li><a href="#sec-4-3">4.3. Using code in other namespaces</a></li>
<li><a href="#sec-4-4">4.4. require, use, and import</a></li>
<li><a href="#sec-4-5">4.5. Reloading namespaces</a></li>
<li><a href="#sec-4-6">4.6. The namespace declaration</a></li>
</ul>
</li>
<li><a href="#sec-5">5. <span class="todo TODO">TODO</span> Working with Java Code &amp; Clojure</a>
<ul>
<li><a href="#sec-5-1">5.1. Importing Java packages</a></li>
<li><a href="#sec-5-2">5.2. Using static class members</a></li>
<li><a href="#sec-5-3">5.3. Creating objects</a></li>
<li><a href="#sec-5-4">5.4. Calling instance methods</a></li>
</ul>
</li>
<li><a href="#sec-6">6. More Clojure Syntax</a>
<ul>
<li><a href="#sec-6-1">6.1. Execution (do, doseq, dotimes)</a></li>
<li><a href="#sec-6-2">6.2. Conditionals (if, cond, condp, case)</a></li>
<li><a href="#sec-6-3">6.3. Iteration (while, for, loop)</a></li>
<li><a href="#sec-6-4">6.4. Recursion</a></li>
<li><a href="#sec-6-5">6.5. Tail recursion</a></li>
<li><a href="#sec-6-6">6.6. Exception handling</a></li>
<li><a href="#sec-6-7">6.7. Destructuring</a></li>
<li><a href="#sec-6-8">6.8. Using keys and or Named arguments</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Macros</a>
<ul>
<li><a href="#sec-7-1">7.1. Exploring Macros</a></li>
<li><a href="#sec-7-2">7.2. Creating our Own Macros</a></li>
<li><a href="#sec-7-3">7.3. Using Templating to Create Macros</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Data Structures</a>
<ul>
<li><a href="#sec-8-1">8.1. The four basic structures:</a></li>
<li><a href="#sec-8-2">8.2. lists</a></li>
<li><a href="#sec-8-3">8.3. vectors</a></li>
<li><a href="#sec-8-4">8.4. maps</a></li>
<li><a href="#sec-8-5">8.5. sets</a></li>
<li><a href="#sec-8-6">8.6. Sequences</a></li>
<li><a href="#sec-8-7">8.7. Lazy Sequences</a></li>
<li><a href="#sec-8-8">8.8. Operations on sequences (eg map, reduce, filter)</a></li>
<li><a href="#sec-8-9">8.9. Design Considerations for Clojure programming</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Polymorphism</a>
<ul>
<li><a href="#sec-9-1">9.1. Protocols</a></li>
<li><a href="#sec-9-2">9.2. Defining and using Types</a></li>
<li><a href="#sec-9-3">9.3. Defining and using Records</a></li>
<li><a href="#sec-9-4">9.4. Handling Java with interop</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Intro to Concurency</a></li>
<li><a href="#sec-11">11. Intro to Web Programming with Clojure</a>
<ul>
<li><a href="#sec-11-1">11.1. Ring</a></li>
<li><a href="#sec-11-2">11.2. Compojure</a></li>
<li><a href="#sec-11-3">11.3. Other foundational libraries</a></li>
<li><a href="#sec-11-4">11.4. Web Programming with Clojure (contd)</a></li>
<li><a href="#sec-11-5">11.5. Restful Services with Clojure</a></li>
<li><a href="#sec-11-6">11.6. HTML Templating library</a></li>
<li><a href="#sec-11-7">11.7. REST API library</a></li>
<li><a href="#sec-11-8">11.8. State Management in projects</a></li>
<li><a href="#sec-11-9">11.9. Clojurescript introduction (optional)</a></li>
<li><a href="#sec-11-10">11.10. Deployment</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Intro to Functional Programming with Clojure</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> What is functional programming</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Functions are first class objects
</p>
<ul class="org-ul">
<li>It can be created on demand.
</li>
<li>It can be stored in a data structure.
</li>
<li>It can be passed as an argument to a function.
</li>
<li>It can be returned as the value of a function.
</li>
</ul>
</div>

<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Why do we need functional programming?</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
In computer science, functional programming is a programming paradigm style of building the structure and elements of computer programs that treats computation as the evaluation of
mathematical functions and avoids changing-state and mutable data.
</p>

<p>
Functional programming makes it easy to implement distributed/parallel computing.
</p>

<p>
Moore's law for computing hardware is fluctuating. Processors are not getting faster anymore.
More efficient computing is achieved by adding more cores.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Higher order functions</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Functions that can take functions or values as an input and return a new function or functions as output.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Anonymous Functions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Anonymous functtions are functions without an identity or a name.
These type of functions are commonly used as callbacks for an event where no other reference is needed.
Another use case for anonymous functions is using it as a filter for a data set or applying a functional transformation for a set of data
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Functional composition</h3>
<div class="outline-text-3" id="text-1-4">
<p>
"Function Composition" is applying one function to the results of another.
You can have a pipe line of functions through which data is passed through. And this pipe line can be termed as a new function.
You can create a new function from a set of functions.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Pure functions and immutablilty</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Pure function is a function which has no side effects. It does not depend on any external entities.
For every input, there is only one out put
Example: Area of a circle = pi*r*r
</p>

<p>
Examples of impure functions: current time, or time related functions. Database operations. File operations or reading data from an external API
</p>
</div>
</div>


<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Map Reduce Filter</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Map reduce is a programming model. A map reduce approach helps in distributed computing.
</p>
</div>

<div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> Map</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Common syntax:
</p>

<p>
map-&gt;function-&gt;data set
</p>

<p>
Outputs a set of data
</p>

<p>
Function in a map accepts a value or another function.
</p>

<p>
Example case: Increment every value in an array by one
</p>

<p>
syntax: map increment-function array
</p>
</div>
</div>

<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> Reduce</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
Common syntax:
</p>

<p>
reduce-&gt;function &lt;optional initial value&gt; -&gt; data set
</p>

<p>
Reduce function accepts two values, previous value and next value
Returns a single output entity which is a reduced form of dataset
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Intoduction to Clojure</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> What is Clojure</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Clojure is a general purpose, compiled, dynamic, functional programming language.
Clojure is a member of the Lisp family of languages.
Lisp was a revolutionary programming language which first appeared in 1958 and was too advanced at that time.
Lisp was originally created as a practical mathematical notation for computer programs, influenced by lambda calculus
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Advantages of Clojure</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Clojure is simple. <b>Simple is elegant, simple is beautiful.</b>
</li>
<li>Clojure uses lesser lines of code. Anywhere between 10-20x lesser lines of code than Java.
</li>
<li>Clojure is a Lisp. <b>Code is Data</b>
</li>
<li>Clojure is functional <b>Functional programming will be a necessary programming model in the near future</b>
</li>
<li>Clojure supports true concurrent models
</li>
<li>Clojure REPL helps in interactive development
</li>
<li>Clojure runs on JVM
It can take advantage of highly optimized JVM and its garbage collector. It can utilize Java libraries
</li>
<li>Clojure can be used as a replacement for javascript in the front end
</li>
</ul>
</div>
</div>



<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Disadvantages of Clojure</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Major shift in programming model.
</li>
<li>Lisp syntax is different and some people never gets it.
</li>
<li>Relatively new technology. Released in 2007 and fewer libraries and developers
</li>
</ul>
</div>
</div>
