content.org
** Installing Clojure
   Using Leiningen http://leiningen.org/
   
   1. Download the lein script (or on Windows lein.bat)
   2. Place it on your $PATH where your shell can find it (eg. ~/bin)
   3. Set it to be executable (chmod a+x ~/bin/lein)
   4. Run it (lein) and it will download the self-install package
   
     #+BEGIN_SRC bash
     lein new <project-name>
     #+END_SRC
   This command will start a new project

** Tooling

*** IDE
    Clojure syntax is very simple that you don't actually need an IDE. You can do Clojure development in a simple text editor.
    
    Recommended editors/IDE:
    
    1. Emacs: *Unlimited awesomeness* https://www.gnu.org/software/emacs/
       Emacs is built with a Lisp. Highly customizable. Steeper learning curve.
    2. Cursive: *For the software engineer* https://cursive-ide.com/
    3. Eclipse + Counterclockwise *For the enterprise developer who is already working on Java* http://doc.ccw-ide.org/documentation.html
       
    
* Basic Clojure Syntax and REPL

** Lisp syntax
   Clojure is a homoiconic language, which means Clojure code itself is a data (list). Clojure code is executed by evaluating a data structure. Clojure code can modify, transform and create other Clojure programs.
   *Programs creating programs.*
   Recommended Reading for more enlightenment: http://clojure.org/reference/reader
   
** The REPL
   *The Read Eval Print Loop* 
   Clojure REPL is an interactive shell which can be connected to a running program and modifications can be made and tested on a live program.
   
   Staring a REPL
   
   cd into your project folder
    #+BEGIN_SRC bash
     lein repl
    #+END_SRC
   
   
** Code execution and Project Structure

    Creating a project:
    
     #+BEGIN_SRC bash
      lein new <project-name>
      #+END_SRC
    
    Running a project 

     #+BEGIN_SRC bash
      lein run
     #+END_SRC

    The "main" entry point will be executed.

    The main entry point is defined in the project.clj file in the project folder {:main tutorial.core}
    
    Clojure code is organized similar to JAVA projects
    

*** Source code
    Source code path is defined in project as {:source-paths ["src/clj"]}
    It is a common practice to put all the clojure source code inside "src/clj". 
    
    Clojure project may contain java source code or clojurescript source code. They will be put inside "src/java" or "src/cljs" directories.

    Java source code path must be defined using the key :java-source-paths
    Java source code path example :java-source-paths ["src/java"]
     
* Clojure Namespaces
  
  
** What is a namespace?
   
   Namespace is a structural identity of a source code file.
   
   - What def does
   - What namespaces are and how to use them
   - The relationship between namespaces and the filesystem
   - How to use refer, alias, require, use, and ns
   - How to organize Clojure projects using the filesystem

   
** The 'user' namespace
   When you start the REPL, for example, you are in the user namespace
   
** Using code in other namespaces
   - require (strict)
   - use (import everything into this namespace)
   - refer (refer particular functions only)
   
** require, use, and import

   #+BEGIN_SRC clojure
   (ns myproject.core
    (:use [clojure.core] :reload)
    (:require [clojure.string :as str :refer [replace]] :reload-all))

    (str/replace "foo" #"o" "e")
   "fee"
   #+END_SRC
   
** Reloading namespaces
   #+BEGIN_SRC bash
user=> (use '[clojure.tools.namespace.repl :only (refresh)])

user=> (refresh)

:reloading (namespace.app)

:ok

#+END_SRC
   
** The namespace declaration
   (ns directory-path.filename)
   
* TODO Working with Java Code & Clojure

** Importing Java packages
** Using static class members
** Creating objects
** Calling instance methods
   

* More Clojure Syntax

** Execution (do, doseq, dotimes)
   
   
    #+BEGIN_SRC clojure
       (do  something)
    #+END_SRC
   
   
   #+BEGIN_SRC clojure
   (doseq [each all]
     (do-something each))
   #+END_SRC


   #+BEGIN_SRC clojure
    (dotimes [n 5] (println "n is" n))
   #+END_SRC
     
** Conditionals (if, cond, condp, case)
   #+BEGIN_SRC clojure
   (if test then else?) 
   #+END_SRC
   
   OR
   
   #+BEGIN_SRC clojure
   (if test then)
   #+END_SRC

** Iteration (while, for, loop)
   
   #+BEGIN_SRC clojure
(while condition
(do-somthing))
   #+END_SRC

*for*

List comprehension. Takes a vector of one or more
 binding-form/collection-expr pairs, each followed by zero or more
 modifiers, and yields a lazy sequence of evaluations of expr.
 Collections are iterated in a nested fashion, rightmost fastest,
 and nested coll-exprs can refer to bindings created in prior
 binding-forms.  Supported modifiers are: :let [binding-form expr ...],
 :while test, :when test.
 (take 100 (for [x (range 100000000) y (range 1000000) :while (< y x)] [x y]))

#+BEGIN_SRC clojure
(for [x [0 1 2 3 4 5]
      :let [y (* x 3)]
      :when (even? y)]
  y)

#+END_SRC
   
** Recursion
   Factorial Example:
   
   #+BEGIN_SRC clojure
   (defn fact[x]
  (if (<= x 1) 1 (* x  (fact (- x 1))  )))
   #+END_SRC

   Use recursion only when no other way is possible. Most of the time you can use *reduce* operation to attain the same result

   Alternate way of implementing factorial without recursion:

   #+BEGIN_SRC clojure
(defn fact[n]
(if (= 0 n) 1 (reduce * (range 1 (inc n)))))
   #+END_SRC
   
