content.html

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Installing Clojure</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Using Leiningen <a href="http://leiningen.org/">http://leiningen.org/</a>
</p>

<ol class="org-ol">
<li>Download the lein script (or on Windows lein.bat)
</li>
<li>Place it on your $PATH where your shell can find it (eg. ~/bin)
</li>
<li>Set it to be executable (chmod a+x ~/bin/lein)
</li>
<li>Run it (lein) and it will download the self-install package

<div class="org-src-container">

<pre class="src src-bash">lein new &lt;project-name&gt;
</pre>
</div>
</li>
</ol>
<p>
This command will start a new project
</p>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Tooling</h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> IDE</h4>
<div class="outline-text-4" id="text-2-5-1">
<p>
Clojure syntax is very simple that you don't actually need an IDE. You can do Clojure development in a simple text editor.
</p>

<p>
Recommended editors/IDE:
</p>

<ol class="org-ol">
<li>Emacs: <b>Unlimited awesomeness</b> <a href="https://www.gnu.org/software/emacs/">https://www.gnu.org/software/emacs/</a>
       Emacs is built with a Lisp. Highly customizable. Steeper learning curve.
</li>
<li>Cursive: <b>For the software engineer</b> <a href="https://cursive-ide.com/">https://cursive-ide.com/</a>
</li>
<li>Eclipse + Counterclockwise <b>For the enterprise developer who is already working on Java</b> <a href="http://doc.ccw-ide.org/documentation.html">http://doc.ccw-ide.org/documentation.html</a>
</li>
</ol>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Basic Clojure Syntax and REPL</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Lisp syntax</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Clojure is a homoiconic language, which means Clojure code itself is a data (list). Clojure code is executed by evaluating a data structure. Clojure code can modify, transform and create other Clojure programs.
<b>Programs creating programs.</b>
Recommended Reading for more enlightenment: <a href="http://clojure.org/reference/reader">http://clojure.org/reference/reader</a>
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The REPL</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<b>The Read Eval Print Loop</b> 
Clojure REPL is an interactive shell which can be connected to a running program and modifications can be made and tested on a live program.
</p>

<p>
Staring a REPL
</p>

<p>
cd into your project folder
</p>
<div class="org-src-container">

<pre class="src src-bash">lein repl
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Code execution and Project Structure</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Creating a project:
</p>

<div class="org-src-container">

<pre class="src src-bash">lein new &lt;project-name&gt;
</pre>
</div>

<p>
Running a project 
</p>

<div class="org-src-container">

<pre class="src src-bash">lein run
</pre>
</div>

<p>
The "main" entry point will be executed.
</p>

<p>
The main entry point is defined in the project.clj file in the project folder {:main tutorial.core}
</p>

<p>
Clojure code is organized similar to JAVA projects
</p>
</div>


<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Source code</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Source code path is defined in project as {:source-paths ["src/clj"]}
It is a common practice to put all the clojure source code inside "src/clj". 
</p>

<p>
Clojure project may contain java source code or clojurescript source code. They will be put inside "src/java" or "src/cljs" directories.
</p>

<p>
Java source code path must be defined using the key :java-source-paths
Java source code path example :java-source-paths ["src/java"]
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Clojure Namespaces</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> What is a namespace?</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Namespace is a structural identity of a source code file.
</p>

<ul class="org-ul">
<li>What def does
</li>
<li>What namespaces are and how to use them
</li>
<li>The relationship between namespaces and the filesystem
</li>
<li>How to use refer, alias, require, use, and ns
</li>
<li>How to organize Clojure projects using the filesystem
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> The 'user' namespace</h3>
<div class="outline-text-3" id="text-4-2">
<p>
When you start the REPL, for example, you are in the user namespace
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Using code in other namespaces</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>require (strict)
</li>
<li>use (import everything into this namespace)
</li>
<li>refer (refer particular functions only)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> require, use, and import</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">

<pre class="src src-clojure">(ns myproject.core
 (:use [clojure.core] :reload)
 (:require [clojure.string :as str :refer [replace]] :reload-all))

 (str/replace "foo" #"o" "e")
"fee"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Reloading namespaces</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">

<pre class="src src-bash">user=&gt; (use '[clojure.tools.namespace.repl :only (refresh)])

user=&gt; (refresh)

:reloading (namespace.app)

:ok
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> The namespace declaration</h3>
<div class="outline-text-3" id="text-4-6">
<p>
(ns directory-path.filename)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Working with Java Code &amp; Clojure</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Importing Java packages</h3>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Using static class members</h3>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Creating objects</h3>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Calling instance methods</h3>
</div>
</div>


<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> More Clojure Syntax</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Execution (do, doseq, dotimes)</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-clojure">(do  something)
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(doseq [each all]
  (do-something each))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(dotimes [n 5] (println "n is" n))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Conditionals (if, cond, condp, case)</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-clojure">(if test then else?)
</pre>
</div>

<p>
OR
</p>

<div class="org-src-container">

<pre class="src src-clojure">(if test then)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Iteration (while, for, loop)</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-clojure">(while condition
(do-somthing))
</pre>
</div>

<p>
<b>for</b>
</p>

<p>
List comprehension. Takes a vector of one or more
 binding-form/collection-expr pairs, each followed by zero or more
 modifiers, and yields a lazy sequence of evaluations of expr.
 Collections are iterated in a nested fashion, rightmost fastest,
 and nested coll-exprs can refer to bindings created in prior
 binding-forms.  Supported modifiers are: :let [binding-form expr &#x2026;],
</p>
<p>
:while test, :when test.
(take 100 (for [x (range 100000000) y (range 1000000) :while (&lt; y x)] [x y]))
</p>

<div class="org-src-container">

<pre class="src src-clojure">(for [x [0 1 2 3 4 5]
      :let [y (* x 3)]
      :when (even? y)]
  y)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Recursion</h3>
<div class="outline-text-3" id="text-6-4">
<p>
Factorial Example:
</p>

<div class="org-src-container">

<pre class="src src-clojure"> (defn fact[x]
(if (&lt;= x 1) 1 (* x  (fact (- x 1))  )))
</pre>
</div>

<p>
Use recursion only when no other way is possible. Most of the time you can use <b>reduce</b> operation to attain the same result
</p>

<p>
Alternate way of implementing factorial without recursion:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(defn fact[n]
(if (= 0 n) 1 (reduce * (range 1 (inc n)))))
</pre>
</div>
</div>
</div>
