content.html

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> Tail recursion</h3>
<div class="outline-text-3" id="text-6-5">
<p>
Factorial example:
</p>

<div class="org-src-container">

<pre class="src src-clojure">(defn fact [x]
 (loop [n x f 1]
     (if (= n 1)
	 f
	 (recur (dec n) (* f n)))))
</pre>
</div>

<p>
Clojure will do tail-call optimization for this; that ensures that you will never run into StackOverflowErrors.
</p>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> Exception handling</h3>
<div class="outline-text-3" id="text-6-6">
<p>
The exprs are evaluated and, if no exceptions occur, the value of the last
is returned. If an exception occurs and catch clauses are provided, each is
examined in turn and the first for which the thrown exception is an instance
of the named class is considered a matching catch clause
</p>

<div class="org-src-container">

<pre class="src src-clojure">(try
  (/ 1 0)
  (catch Exception e (str "caught exception: " (.getMessage e))))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> Destructuring</h3>
<div class="outline-text-3" id="text-6-7">
<div class="org-src-container">

<pre class="src src-bash">user=&gt; (def point [5 7])
#'user/point

user=&gt; (let [[x y] point]
	 (println "x:" x "y:" y))
x: 5 y: 7
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure">Simply put, destructuring in Clojure is a way extract values from a datastructure and bind them to symbols,

without having to explicitly traverse the datstructure. It allows for elegant and concise Clojure code.

Vectors

Syntax: [symbol another-symbol] ["value" "another-value"]

(def my-vector [:a :b :c :d])
(def my-nested-vector [:a :b :c :d [:x :y :z]])

(let [[a b c d] my-vector]
  (println a b c d))
;; =&gt; :a :b :c :d

(let [[a _ _ d [x y z]] my-nested-vector]
  (println a d x y z))
;; =&gt; :a :d :x :y :z
You don't have to match the full vector.

(let [[a b c] my-vector]
  (println a b c))
;; =&gt; :a :b :c

;;You can use &amp; the-rest to bind the remaining part of the vector to the-rest.

(let [[a b &amp; the-rest] my-vector]
  (println a b the-rest))
;; =&gt; :a :b (:c :d)
;;When a destructuring form "exceeds" a vector (i.e. there not enough items in the vector to bind to), the excess symbols will be bound to nil.

(let [[a b c d e f g] my-vector]
  (println a b c d e f g))
;; =&gt; :a :b :c :d nil nil nil
;;You can use :as some-symbol as the last two items in the destructuring form to bind the whole vector to some-symbol

(let [[:as all] my-vector]
  (println all))
;; =&gt; [:a :b :c :d]

(let [[a :as all] my-vector]
  (println a all))
;; =&gt; :a [:a :b :c :d]

(let [[a _ _ _ [x y z :as nested] :as all] my-nested-vector]
  (println a x y z nested all))
;; =&gt; :a :x :y :z [:x :y :z] [:a :b :c :d [:x :y :z]]
;;You can use both &amp; the-rest and :as some-symbol.

(let [[a b &amp; the-rest :as all] my-vector]
  (println a b the-rest all))
;; =&gt; :a :b (:c :d) [:a :b :c :d]
;;Optional arguments for functions

;;With destructuring and the &amp; the-rest form, you can specify optional arguments to functions.

(defn foo [a b &amp; more-args]
  (println a b more-args))
(foo :a :b) ;; =&gt; :a :b nil
(foo :a :b :x) ;; =&gt; :a :b (:x)
(foo :a :b :x :y :z) ;; =&gt; :a :b (:x :y :z)

(defn foo [a b &amp; [x y z]]
  (println a b x y z))
(foo :a :b) ;; =&gt; :a :b nil nil nil
(foo :a :b :x) ;; =&gt; :a :b :x nil nil
(foo :a :b :x :y :z) ;; =&gt; :a :b :x :y :z

;;Maps

;;Syntax: {symbol :key, another-symbol :another-key} {:key "value" :another-key "another-value"}

(def my-hashmap {:a "A" :b "B" :c "C" :d "D"})
(def my-nested-hashmap {:a "A" :b "B" :c "C" :d "D" :q {:x "X" :y "Y" :z "Z"}})

(let [{a :a d :d} my-hashmap]
  (println a d))
;; =&gt; A D

(let [{a :a, b :b, {x :x, y :y} :q} my-nested-hashmap]
  (println a b x y))
;; =&gt; A B X Y
;;Similar to vectors, if a key is not found in the map, the symbol will be bound to nil.

(let [{a :a, not-found :not-found, b :b} my-hashmap]
  (println a not-found b))
;; =&gt; A nil B
;;You can provide an optional default value for these missing keys with the :or keyword and a map of default values.

(let [{a :a, not-found :not-found, b :b, :or {not-found ":)"}} my-hashmap]
  (println a not-found b))
;; =&gt; A :) B
;;The :as some-symbol form is also available for maps, but unlike vectors it can be specified anywhere (but still preferred to be the last two pairs).

(let [{a :a, b :b, :as all} my-hashmap]
  (println a b all))
;; =&gt; A B {:a A :b B :c C :d D}
;;And combining :as and :or keywords (again, :as preferred to be the last).

(let [{a :a, b :b, not-found :not-found, :or {not-found ":)"}, :as all} my-hashmap]
  (println a b not-found all))
;; =&gt; A B :) {:a A :b B :c C :d D}
;;There is no &amp; the-rest for maps.

;;Shortcuts

;;Having to specify {symbol :symbol} for each key is repetitive and verbose (it's almost always going to be the symbol equivalent of the key), so shortcuts are provided so you only have to type the symbol once.

;;Here are all the previous examples using the :keys keyword followed by a vector of symbols:

(let [{:keys [a d]} my-hashmap]
  (println a d))
;; =&gt; A D

(let [{:keys [a b], {:keys [x y]} :q} my-nested-hashmap]
  (println a b x y))
;; =&gt; A B X Y

(let [{:keys [a not-found b]} my-hashmap]
  (println a not-found b))
;; =&gt; A nil B

(let [{:keys [a not-found b], :or {not-found ":)"}} my-hashmap]
  (println a not-found b))
;; =&gt; A :) B

(let [{:keys [a b], :as all} my-hashmap]
  (println a b all))
;; =&gt; A B {:a A :b B :c C :d D}

(let [{:keys [a b not-found], :or {not-found ":)"}, :as all} my-hashmap]
  (println a b not-found all))
;; =&gt; A B :) {:a A :b B :c C :d D}
;;There are also :strs and :syms alternatives, for when your map has strings or symbols for keys (instead of keywords), respectively.

(let [{:strs [a d]} {"a" "A", "b" "B", "c" "C", "d" "D"}]
  (println a d))
;; =&gt; A D

(let [{:syms [a d]} {'a "A", 'b "B", 'c "C", 'd "D"}]
  (println a d))
;; =&gt; A D
;;Keyword arguments for function

;;Map destructuring also works with lists (but not vectors).

(let [{:keys [a b]} '("X", "Y", :a "A", :b "B")]
(println a b))
;; =&gt; A B
;;This allows your functions to have optional keyword arguments.

(defn foo [a b &amp; {:keys [x y]}]
  (println a b x y))
(foo "A" "B")  ;; =&gt; A B nil nil
(foo "A" "B" :x "X")  ;; =&gt; A B X nil
(foo "A" "B" :x "X" :y "Y")  ;; =&gt; A B X Y
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> Using keys and or Named arguments</h3>
<div class="outline-text-3" id="text-6-8">
<div class="org-src-container">

<pre class="src src-clojure">(keys map)
</pre>
</div>

<p>
Returns all keys of the map
</p>


<p>
Logical operators
</p>

<p>
(and cond1 cond2 &#x2026;.)
</p>


<p>
(or cond1 cond2 &#x2026;.)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Macros</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Exploring Macros</h3>
<div class="outline-text-3" id="text-7-1">
<p>
The number one rule of Macros: <b>Don't use macros</b>
</p>

<p>
Most of the problems can be solved using functional programming. Use macros only if you need to create a DSL
like a query language for a particular Database or a very specific functionality set that is repeated very often.
</p>

<p>
99% of the time you don't need macros
</p>
</div>
</div>
