content.org
** Creating our Own Macros
   
   Macro definitions look much like function definitions.
   They have a name, an optional document string, an argument list, and a body.
   The body will almost always return a list.
   This makes sense because macros are a way of transforming a data structure into a form Clojure can evaluate, and Clojure uses lists to represent function calls, special form calls, and macro calls.
   You can use any function, macro, or special form within the macro body, and you call macros just like you would a function or special form.

   #+BEGIN_SRC clojure
   (defmacro infix
    [infixed]
     (list (second infixed) (first infixed) (last infixed)))
   #+END_SRC


#+BEGIN_SRC clojure

(infix (1 + 1))
; => 2

#+END_SRC



   
** Using Templating to Create Macros
   
   Use: list quote..etc
   
* Data Structures
** The four basic structures:
** lists
   Everything is a list. Even clojure source code is a list
   
   enclosed in a ()
   
** vectors
   Similar to arrays.
   
   Example:
   [1 2 3 4 5]
   
** maps
   
   {:key value}
   
** sets

Sets are collections of unique values.

There is literal support for hash-sets:

#{:a :b :c :d}
-> #{:d :a :b :c}
You can create sets with the hash-set and sorted-set functions:

(hash-set :a :b :c :d)
-> #{:d :a :b :c}

(sorted-set :a :b :c :d)
-> #{:a :b :c :d}
You can also get a set of the values in a collection using the set function:


** Sequences
   
   A logical list
   
** Lazy Sequences

   
** Operations on sequences (eg map, reduce, filter)

   (map function sequence)

   (reduce function sequence)


   (filter function sequence)
   
** Design Considerations for Clojure programming
   
   - Keep it simple
   - Most of the time use pure functions
   - Avoid mutable states
   - Avoid circular dependencies
   
* Polymorphism
** Protocols
** Defining and using Types
** Defining and using Records
** Handling Java with interop


Clojure vector, set and list classes implement the java.util.Collection interface and ArrayList, HashSet and LinkedList can take a java.util.Collection constructor argument. So you can simply do:

#+BEGIN_SRC clojure

user=> (java.util.ArrayList. [1 2 3])
#<ArrayList [1, 2, 3]>
user=> (.get (java.util.ArrayList. [1 2 3]) 0)
1

#+END_SRC

Similarly, Clojure map class implements java.util.Map interface and HashMap takes a java.util.Map constructor argument. So:

#+BEGIN_SRC
user=> (java.util.HashMap. {"a" 1 "b" 2})
#<HashMap {b=2, a=1}>
user=> (.get (java.util.HashMap. {"a" 1 "b" 2}) "a")
1

#+END_SRC

You can also do the reverse and it is much easier:

#+BEGIN_SRC

ser=> (into [] (java.util.ArrayList. [1 2 3]))
[1 2 3]
user=> (into #{} (java.util.HashSet. #{1 2 3}))
#{1 2 3}
user=> (into '() (java.util.LinkedList. '(1 2 3)))
(3 2 1)
user=> (into {} (java.util.HashMap. {:a 1 :b 2}))
{:b 2, :a 1}
#+END_SRC

* Intro to Concurency



* Intro to Web Programming with Clojure
** Ring
   HTTP server abstraction
   
** Compojure
   
   URL Routing specification
   
** Other foundational libraries

   ring middleware
   html templating
   database drivers and orms
   time functions
   validators



** Web Programming with Clojure (contd)
   Programming session
   
** Restful Services with Clojure
   Programming session
   
** HTML Templating library
   Introduction to selmer
   
** REST API library
   
   Introduction to liberator

** State Management in projects
   Mount and Component
   
** Clojurescript introduction (optional)
   
   
** Deployment
   Deploying as a standalone app
   Deploying to tomcat
   Deploying to wildfly (jboss)


