content.html




<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Creating our Own Macros</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Macro definitions look much like function definitions.
They have a name, an optional document string, an argument list, and a body.
The body will almost always return a list.
This makes sense because macros are a way of transforming a data structure into a form Clojure can evaluate, and Clojure uses lists to represent function calls, special form calls, and macro calls.
You can use any function, macro, or special form within the macro body, and you call macros just like you would a function or special form.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(defmacro infix
 [infixed]
  (list (second infixed) (first infixed) (last infixed)))
</pre>
</div>


<div class="org-src-container">

<pre class="src src-clojure">(infix (1 + 1))
; =&gt; 2
</pre>
</div>
</div>
</div>




<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3"><span class="section-number-3">7.3</span> Using Templating to Create Macros</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Use: list quote..etc
</p>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Data Structures</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> The four basic structures:</h3>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> lists</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Everything is a list. Even clojure source code is a list
</p>

<p>
enclosed in a ()
</p>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> vectors</h3>
<div class="outline-text-3" id="text-8-3">
<p>
Similar to arrays.
</p>

<p>
Example:
[1 2 3 4 5]
</p>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> maps</h3>
<div class="outline-text-3" id="text-8-4">
<p>
{:key value}
</p>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> sets</h3>
<div class="outline-text-3" id="text-8-5">
<p>
Sets are collections of unique values.
</p>

<p>
There is literal support for hash-sets:
</p>

<p>
#{:a :b :c :d}
-&gt; #{:d :a :b :c}
You can create sets with the hash-set and sorted-set functions:
</p>

<p>
(hash-set :a :b :c :d)
-&gt; #{:d :a :b :c}
</p>

<p>
(sorted-set :a :b :c :d)
-&gt; #{:a :b :c :d}
You can also get a set of the values in a collection using the set function:
</p>
</div>
</div>


<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> Sequences</h3>
<div class="outline-text-3" id="text-8-6">
<p>
A logical list
</p>
</div>
</div>

<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> Lazy Sequences</h3>
</div>


<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> Operations on sequences (eg map, reduce, filter)</h3>
<div class="outline-text-3" id="text-8-8">
<p>
(map function sequence)
</p>

<p>
(reduce function sequence)
</p>


<p>
(filter function sequence)
</p>
</div>
</div>

<div id="outline-container-sec-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> Design Considerations for Clojure programming</h3>
<div class="outline-text-3" id="text-8-9">
<ul class="org-ul">
<li>Keep it simple
</li>
<li>Most of the time use pure functions
</li>
<li>Avoid mutable states
</li>
<li>Avoid circular dependencies
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Polymorphism</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Protocols</h3>
</div>
<div id="outline-container-sec-9-2" class="outline-3">
<h3 id="sec-9-2"><span class="section-number-3">9.2</span> Defining and using Types</h3>
</div>
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> Defining and using Records</h3>
</div>
<div id="outline-container-sec-9-4" class="outline-3">
<h3 id="sec-9-4"><span class="section-number-3">9.4</span> Handling Java with interop</h3>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Intro to Concurency</h2>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Intro to Web Programming with Clojure</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Ring</h3>
<div class="outline-text-3" id="text-11-1">
<p>
HTTP server abstraction
</p>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Compojure</h3>
<div class="outline-text-3" id="text-11-2">
<p>
URL Routing specification
</p>
</div>
</div>

<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> Other foundational libraries</h3>
<div class="outline-text-3" id="text-11-3">
<p>
ring middleware
html templating
database drivers and orms
time functions
validators
</p>
</div>
</div>



<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> Web Programming with Clojure (contd)</h3>
<div class="outline-text-3" id="text-11-4">
<p>
Programming session
</p>
</div>
</div>

<div id="outline-container-sec-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> Restful Services with Clojure</h3>
<div class="outline-text-3" id="text-11-5">
<p>
Programming session
</p>
</div>
</div>

<div id="outline-container-sec-11-6" class="outline-3">
<h3 id="sec-11-6"><span class="section-number-3">11.6</span> HTML Templating library</h3>
<div class="outline-text-3" id="text-11-6">
<p>
Introduction to selmer
</p>
</div>
</div>

<div id="outline-container-sec-11-7" class="outline-3">
<h3 id="sec-11-7"><span class="section-number-3">11.7</span> REST API library</h3>
<div class="outline-text-3" id="text-11-7">
<p>
Introduction to liberator
</p>
</div>
</div>

<div id="outline-container-sec-11-8" class="outline-3">
<h3 id="sec-11-8"><span class="section-number-3">11.8</span> State Management in projects</h3>
<div class="outline-text-3" id="text-11-8">
<p>
Mount and Component
</p>
</div>
</div>

<div id="outline-container-sec-11-9" class="outline-3">
<h3 id="sec-11-9"><span class="section-number-3">11.9</span> Clojurescript introduction (optional)</h3>
</div>


<div id="outline-container-sec-11-10" class="outline-3">
<h3 id="sec-11-10"><span class="section-number-3">11.10</span> Deployment</h3>
<div class="outline-text-3" id="text-11-10">
<p>
Deploying as a standalone app
Deploying to tomcat
Deploying to wildfly (jboss)
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Devasia Joseph</p>
<p class="date">Created: 2016-04-28 Thu 06:55</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
